src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ЗаписьВРегистр

// Конструктор новой записи регистра
// 
// Возвращаемое значение:  
//  Структура - структура, которая описывает поля записи текущего регистра:
//   * ПолученныйОбъект          - Строка - идентификатор полученного объекта.
//   * ПравилоКонвертации        - Строка - правило конвертации объекта.  
//   * ОбъектКПолучению          - Строка - идентификатор объекта, который требуется получить для загрузки полученного объекта.
//   * УзелПланаОбмена           - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - план обмена корреспондент, из которого
//                                                                               был получен объект.
//   * ОбъектФормата             - Строка - имя блокируемого объекта в пространстве имен.
//   * ИмяРеквизита              - Строка - имя реквизита, для которого требуется получить объекта.
//   * ОписаниеТипа              - Неопределено,
//                                 СправочникСсылка.ИдентификаторыОбъектовМетаданных,
//                                 СправочникСсылка.ИдентификаторыОбъектовРасширений - тип реквизита,
//                                                                             для которого требуется получить объект.
//   * ОбъектФорматаКПолучению   - Строка - имя объекта к получению в пространстве имен.
//   * КомментарийАдминистратора - Строка - комментарий добавленный администратором при разборе проблемы
//
Функция НовыйДанныеЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("ПолученныйОбъект",               "");
	ДанныеЗаписиРегистра.Вставить("ПравилоКонвертации",             "");
	ДанныеЗаписиРегистра.Вставить("ОбъектКПолучению",               "");
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектФормата",                  "");
	ДанныеЗаписиРегистра.Вставить("ОбъектФорматаКПолучению",        "");
	ДанныеЗаписиРегистра.Вставить("ИмяРеквизита",                   "");
	ДанныеЗаписиРегистра.Вставить("ОписаниеТипа",                   Неопределено);
	ДанныеЗаписиРегистра.Вставить("КомментарийАдминистратора",      "");
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Выполняет запись в регистр
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура ЗаписатьДанные(ДанныеЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.ПравилоКонвертации.Установить(ДанныеЗаписи.ПравилоКонвертации);
	НаборЗаписей.Отбор.ОбъектКПолучению.Установить(ДанныеЗаписи.ОбъектКПолучению);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	НаборЗаписей.Отбор.ОбъектФорматаКПолучению.Установить(ДанныеЗаписи.ОбъектФорматаКПолучению);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеЗаписи);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//  НеОтрабатыватьИзменениеНабора - Булево - признак того, что при записи набора не следует выполнять определение
//                                           готовых к загрузке объектов
//  КлючОбрабатывающегоЗадания    - Строка, Неопределено - может содержать ключ задания, в котором выполняется удаление
//
Процедура УдалитьЗаписьРегистра(ДанныеЗаписи, НеОтрабатыватьИзменениеНабора = Ложь, КлючОбрабатывающегоЗадания = Неопределено) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.ОбъектКПолучению.Установить(ДанныеЗаписи.ОбъектКПолучению);
	НаборЗаписей.Отбор.ПравилоКонвертации.Установить(ДанныеЗаписи.ПравилоКонвертации);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	Если НеОтрабатыватьИзменениеНабора Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеОтрабатыватьИзменениеНабора", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючОбрабатывающегоЗадания) Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("КлючОбрабатывающегоЗадания", КлючОбрабатывающегоЗадания);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область БлокировкаЗаписей

// Блокирует набора записей регистра для дальнейшего изменения.
// 
// Параметры:
//  ПолученныйОбъект   - Строка
//  ПравилоКонвертации - Строка
//  УзелПланаОбмена   - ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был получен объект.
//  ОбъектФормата             - Строка - имя объекта в пространстве имен.
//
Процедура ЗаблокироватьНаборЗаписейПоПолученномуОбъектуИПравилуКонвертации(ПолученныйОбъект, ПравилоКонвертации, УзелПланаОбмена, ОбъектФормата) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбъектыБлокирующиеЗагрузку");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ПолученныйОбъект",   ПолученныйОбъект);
	ЭлементБлокировки.УстановитьЗначение("ПравилоКонвертации", ПравилоКонвертации);
	ЭлементБлокировки.УстановитьЗначение("УзелПланаОбмена",    УзелПланаОбмена);
	ЭлементБлокировки.УстановитьЗначение("ОбъектФормата",      ОбъектФормата);
	
	// @skip-warning
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Блокирует запись регистра для дальнейшего изменения.
// 
// Параметры:
//  ПолученныйОбъект        - Строка - идентификатор полученного объекта.
//  ОбъектКПолучению        - Строка - идентификатор объекта, который требуется получить для загрузки полученного объекта.
//  ПравилоКонвертации      - Строка - правило конвертации объекта.
//  УзелПланаОбмена         - ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был получен объект.
//  ОбъектФормата           - Строка - имя полученного объекта в пространстве имен.
//  ОбъектФорматаКПолучению - Строка - имя объекта к получению в пространстве имен.
//
Процедура ЗаблокироватьЗаписьРегистра(ПолученныйОбъект, ОбъектКПолучению, ПравилоКонвертации, УзелПланаОбмена, ОбъектФормата, ОбъектФорматаКПолучению) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбъектыБлокирующиеЗагрузку");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ПолученныйОбъект",        ПолученныйОбъект);
	ЭлементБлокировки.УстановитьЗначение("ПравилоКонвертации",      ПравилоКонвертации);
	ЭлементБлокировки.УстановитьЗначение("ОбъектКПолучению",        ОбъектКПолучению);
	ЭлементБлокировки.УстановитьЗначение("УзелПланаОбмена",         УзелПланаОбмена);
	ЭлементБлокировки.УстановитьЗначение("ОбъектФормата",           ОбъектФормата);
	ЭлементБлокировки.УстановитьЗначение("ОбъектФорматаКПолучению", ОбъектФорматаКПолучению);
	
	//@skip-check lock-out-of-try
	Блокировка.Заблокировать();
	
КонецПроцедуры 

// Блокирует набора записей регистра для дальнейшего изменения.
// 
// Параметры:
//  ПолученныйОбъект - Строка - идентификатор полученного объекта.
//  УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был получен объект.
//  ОбъектФормата    - Строка - объект формата полученного объекта.
//
Процедура ЗаблокироватьНаборЗаписейПоПолученномуОбъекту(ПолученныйОбъект, УзелПланаОбмена, ОбъектФормата) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбъектыБлокирующиеЗагрузку");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ПолученныйОбъект", ПолученныйОбъект);
	ЭлементБлокировки.УстановитьЗначение("УзелПланаОбмена",  УзелПланаОбмена);
	ЭлементБлокировки.УстановитьЗначение("ОбъектФормата",    ОбъектФормата);
	
	// @skip-warning
	Блокировка.Заблокировать();
	
КонецПроцедуры
#КонецОбласти

#Область УдалениеЗаписей

// Удалить записи регистра по полученному объекту.
// 
// Параметры:
//  ПолученныйОбъект - Строка
//  УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был получен объект.
//  ОбъектФормата     - Строка - имя объекта в пространстве имен.
//
Процедура УдалитьЗаписиРегистраПоПолученномуОбъекту(ПолученныйОбъект, УзелПланаОбмена, ОбъектФормата) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗаблокироватьНаборЗаписейПоПолученномуОбъекту(ПолученныйОбъект, УзелПланаОбмена, ОбъектФормата);
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ПолученныйОбъект);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ОбъектФормата);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Удалить записи регистра по полученному объекту и правилу конвертации.
// 
// Параметры:
//  ПолученныйОбъект   - Строка
//  ПравилоКонвертации - Строка
//  УзелПланаОбмена    - ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был получен объект.
//  ОбъектФормата      - Строка - имя объекта в пространстве имен.
//
Процедура УдалитьЗаписиРегистраПоПолученномуОбъектуПравилуКонвертации(ПолученныйОбъект, ПравилоКонвертации, УзелПланаОбмена, ОбъектФормата) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	ЗаблокироватьНаборЗаписейПоПолученномуОбъектуИПравилуКонвертации(ПолученныйОбъект, ПравилоКонвертации, УзелПланаОбмена, ОбъектФормата);
	
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ПолученныйОбъект);
	НаборЗаписей.Отбор.ПравилоКонвертации.Установить(ПравилоКонвертации);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ОбъектФормата);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Удаляет записи регистра по переданной таблице.
// 
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений - содержит:
//   * ПолученныйОбъект        - Строка
//   * ПравилоКонвертации      - Строка
//   * ОбъектКПолучению        - Строка
//   * УзелПланаОбмена         - ПланОбменаСсылкаИмяПланаОбмена
//   * ОбъектФормата           - Строка
//   * ОбъектФорматаКПолучению - Строка
//  НеОтрабатыватьИзменениеНабора - Булево - признак, того что не требуется выполнять определение более неблокируемых объектов 
//  КлючОбрабатывающегоЗадания    - Строка, Неопределено - может содержать ключ обрабатывающего задания, в котором
//                                                         выполняется удаление
//
Процедура УдалитьЗаписиРегистраПоТаблице(ТаблицаДанных, НеОтрабатыватьИзменениеНабора = Ложь, КлючОбрабатывающегоЗадания = Неопределено) Экспорт
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
	
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ПолученныйОбъект        = СтрокаТаблицы.ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации      = СтрокаТаблицы.ПравилоКонвертации;
		ДанныеЗаписи.ОбъектКПолучению        = СтрокаТаблицы.ОбъектКПолучению;
		ДанныеЗаписи.УзелПланаОбмена         = СтрокаТаблицы.УзелПланаОбмена;
		ДанныеЗаписи.ОбъектФормата           = СтрокаТаблицы.ОбъектФормата;
		ДанныеЗаписи.ОбъектФорматаКПолучению = СтрокаТаблицы.ОбъектФорматаКПолучению;
		
		УдалитьЗаписьРегистра(ДанныеЗаписи, НеОтрабатыватьИзменениеНабора, КлючОбрабатывающегоЗадания);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область КомплексныеМетодыЗаписи

// Удаляет записи регистра, в которых есть информация о том, что объект, блокирует другие объекты.
//
// Параметры:
//  ИдентификаторОбъектаКПолучению - Строка - идентификатор объекта, записи о блокировке которым должны быть удалены.
//
Процедура СнятьБлокировкуОбъектомДругихОбъектов(ИдентификаторОбъектаКПолучению) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена         КАК УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФормата           КАК ОбъектФормата,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|ГДЕ
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению = &ИдентификаторОбъектаКПолучению";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаКПолучению", ИдентификаторОбъектаКПолучению);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ПолученныйОбъект        = Выборка.ПолученныйОбъект;
		ДанныеЗаписи.ОбъектКПолучению        = Выборка.ОбъектКПолучению;
		ДанныеЗаписи.ПравилоКонвертации      = Выборка.ПравилоКонвертации;
		ДанныеЗаписи.УзелПланаОбмена         = Выборка.УзелПланаОбмена;
		ДанныеЗаписи.ОбъектФормата           = Выборка.ОбъектФормата;
		ДанныеЗаписи.ОбъектФорматаКПолучению = Выборка.ОбъектФорматаКПолучению;
		
		УдалитьЗаписьРегистра(ДанныеЗаписи);
	
	КонецЦикла;
	
КонецПроцедуры

// Выполняет удаление необходимых записей после установки соответствий.
// 
// Параметры:
//  ТаблицаЗаписейКПроверке - ТаблицаЗначений - содержит:
//   * Идентификатор - Строка
//   * УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена
//  КлючОбрабатывающегоЗадания - Строка, Неопределено - может содержать ключ обрабатывающего задания, в котором
//                                                      выполняется запись
//
Процедура ОбработатьНовыеУстановленныеСоответствия(ТаблицаЗаписейКПроверке, КлючОбрабатывающегоЗадания = Неопределено) Экспорт
	
	Если ТаблицаЗаписейКПроверке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписейКУдалению = ДанныеЗаписейКУдалениюПослеУстановкиСоответствий(ТаблицаЗаписейКПроверке);
	
	УдалитьЗаписиРегистраПоТаблице(ДанныеЗаписейКУдалению, Ложь, КлючОбрабатывающегоЗадания)
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанныхФоновымЗаданием

// Используется фоновым заданием по получению количества блокируемых объектов.
// Параметры:
//  ПараметрыПодготовки  - Структура - содержит:
//   * ПолученныйОбъект - Строка - идентификатор объекта
//   * ОбъектФормата    - Строка - имя объекта формата
//   * УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - план обмена корреспондент, из которого был
//                                                                       получен объект.
//  АдресХранилища       - Строка - адрес временного хранилища, в которое будут помещены полученные данные
//
Процедура ПолучитьКоличествоБлокируемыхОбъектов(ПараметрыПодготовки, АдресХранилища) Экспорт
	
	ДанныеБлокировки = КоличествоБлокируемыхОбъектов(ПараметрыПодготовки);
	
	ПоместитьВоВременноеХранилище(ДанныеБлокировки, АдресХранилища);
	
КонецПроцедуры

// Используется фоновым заданием по получению данных блокируемых объектов.
// Параметры:
//  ПараметрыПодготовки  - Структура - содержит:
//  * ОбъектДляАнализа    - Строка - объект, для которого получается информация о количестве блокируемых им объектов
//  АдресХранилища       - Строка - адрес временного хранилища, в которое будут помещены полученные данные
//
Процедура ПолучитьДанныеБлокируемыхОбъектов(ПараметрыПодготовки, АдресХранилища) Экспорт
	
	ДанныеБлокировки = ДанныеВсехБлокируемыхОбъектов(ПараметрыПодготовки);
	
	ПоместитьВоВременноеХранилище(ДанныеБлокировки, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область ДанныеБлокируемыхОбъектов

// Получает данные непосредственно и опосредовано блокируемых объектов
// 
// Параметры:
//  ДанныеОбъекта - Структура - содержит:
//   * ПолученныйОбъект - Строка - идентификатор объекта
//   * ОбъектФормата    - Строка - имя объекта формата
//   * УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - план обмена корреспондент, из которого был
//                                                                       получен объект.
// 
// Возвращаемое значение:
//  Структура - Данные всех блокируемых объектов:
//  * БлокируетНепосредственно - Неопределено, ТаблицаЗначений - 
//  * БлокируетОпосредовано    - Неопределено, ТаблицаЗначений - 
//
Функция ДанныеВсехБлокируемыхОбъектов(ДанныеОбъекта) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БлокируетНепосредственно", Неопределено);
	Результат.Вставить("БлокируетОпосредовано",    Неопределено);
	
	БлокирующиеОбъекты = Новый Массив;
	БлокирующиеОбъекты.Добавить(ДанныеОбъекта);
	
	Результат.БлокируетНепосредственно = ДанныеБлокируемыхОбъектовДляМассиваОбъектов(БлокирующиеОбъекты);
	Результат.БлокируетОпосредовано    = ДанныеОпосредованоБлокируемыхОбъектов(Результат.БлокируетНепосредственно);
	
	Возврат Результат;
	
КонецФункции

// Получает количество непосредственно и опосредовано блокируемых объектов
// 
// Параметры:
//  ОбъектДляАнализа - Строка - Объект для анализа
// 
// Возвращаемое значение:
//  Структура - Данные всех блокируемых объектов:
//  * БлокируетНепосредственно - Число - 
//  * БлокируетОпосредовано    - Число - 
//
Функция КоличествоБлокируемыхОбъектов(ОбъектДляАнализа) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БлокируетНепосредственно", 0);
	Результат.Вставить("БлокируетОпосредовано",    0);
	
	ДанныеБлокируемыхОбъектов = ДанныеВсехБлокируемыхОбъектов(ОбъектДляАнализа);
	
	Если ДанныеБлокируемыхОбъектов.БлокируетНепосредственно <> Неопределено Тогда
		Результат.БлокируетНепосредственно = ДанныеБлокируемыхОбъектов.БлокируетНепосредственно.Количество();
	КонецЕсли;
	Если ДанныеБлокируемыхОбъектов.БлокируетОпосредовано <> Неопределено Тогда
		Результат.БлокируетОпосредовано    = ДанныеБлокируемыхОбъектов.БлокируетОпосредовано.Количество();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОчисткаЗаписейПослеУстановкиСоответствий

// Конструктор таблицы идентификаторов для проверки.
// 
// Возвращаемое Значение:
//  ТаблицаЗначений - содержит:
//   * Идентификатор - Строка
//   * УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена
//  НеОтрабатыватьИзменениеНабора - Булево - признак, того что не требуется выполнять определение более неблокируемых объектов 
//
Функция НовыйТаблицаИдентификаторовКПроверке() Экспорт
	
	ТаблицаИдентификаторов = Новый ТаблицаЗначений;
	ТаблицаИдентификаторов.Колонки.Добавить("Идентификатор",          ОбщегоНазначения.ОписаниеТипаСтрока(40));
	ТаблицаИдентификаторов.Колонки.Добавить("ОбъектФормата",          ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаИдентификаторов.Колонки.Добавить("УзелИнформационнойБазы", РаботаСРезультатамиОбмена.ОписаниеТипаПланыОбменаБСП());
	
	Возврат ТаблицаИдентификаторов;
	
КонецФункции

// Получает данные записей регистра, которые требуется удалить после установки соответствий.
// 
// Параметры:
//  ТаблицаЗаписейКПроверке - ТаблицаЗначений - содержит:
//   * Идентификатор - Строка
//   * УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена
//
// Возвращаемое Значение:
//  Неопределено, ТаблицаЗначений - содержит:
//   * ПолученныйОбъект - Строка
//   * ПравилоКонвертации - Строка
//   * ОбъектКПолучению - Строка
Функция ДанныеЗаписейКУдалениюПослеУстановкиСоответствий(ТаблицаЗаписейКПроверке) Экспорт
	
	Если ТаблицаЗаписейКПроверке.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеКПроверке.Идентификатор          КАК Идентификатор,
	|	ДанныеКПроверке.ОбъектФормата          КАК ОбъектФормата,
	|	ДанныеКПроверке.УзелИнформационнойБазы КАК УзелИнформационнойБазы
	|ПОМЕСТИТЬ ДанныеКПроверке
	|ИЗ
	|	&ДанныеКПроверке КАК ДанныеКПроверке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКПроверке.УзелИнформационнойБазы             КАК УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФормата           КАК ОбъектФормата,
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации      КАК ПравилоКонвертации
	|ПОМЕСТИТЬ ДанныеБлокирующихОбъектов
	|ИЗ
	|	ДанныеКПроверке КАК ДанныеКПроверке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ДанныеКПроверке.Идентификатор         = ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению
	|		И ДанныеКПроверке.УзелИнформационнойБазы = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена
	|		И ДанныеКПроверке.ОбъектФормата = ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеБлокирующихОбъектов.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ДанныеБлокирующихОбъектов.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ДанныеБлокирующихОбъектов.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	ДанныеБлокирующихОбъектов.УзелПланаОбмена         КАК УзелПланаОбмена,
	|	ДанныеБлокирующихОбъектов.ОбъектФормата           КАК ОбъектФормата,
	|	ДанныеБлокирующихОбъектов.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению
	|ИЗ
	|	ДанныеБлокирующихОбъектов КАК ДанныеБлокирующихОбъектов";
	
	Запрос.УстановитьПараметр("ДанныеКПроверке", ТаблицаЗаписейКПроверке);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ОчисткаНекорректныхЗаписей

// Проверяет записи, у которых нет соответствующей объекту к получению в РС "Объекты к загрузке" и выполняет такие записи
Процедура ПроверитьЗаписиБезСоответствийВОбъектыКЗагрузке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена         КАК УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФормата           КАК ОбъектФормата,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению = ОбъектыКЗагрузке.ПолученныйОбъект
	|		И  ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|		И  ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению = ОбъектыКЗагрузке.ОбъектФормата
	|ГДЕ
	|	ОбъектыКЗагрузке.ПолученныйОбъект ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена         КАК УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФормата           КАК ОбъектФормата,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект      = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена    = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФормата      = ОбъектыКЗагрузке.ОбъектФормата
	|ГДЕ
	|	ОбъектыКЗагрузке.ПолученныйОбъект ЕСТЬ NULL
	|";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНетБлокируемогоОбъекта = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаНетБлокируемогоОбъекта.Следующий() Цикл
			
			ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
			ДанныеЗаписи.ПолученныйОбъект        = ВыборкаНетБлокируемогоОбъекта.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации      = ВыборкаНетБлокируемогоОбъекта.ПравилоКонвертации;
			ДанныеЗаписи.ОбъектКПолучению        = ВыборкаНетБлокируемогоОбъекта.ОбъектКПолучению;
			ДанныеЗаписи.УзелПланаОбмена         = ВыборкаНетБлокируемогоОбъекта.УзелПланаОбмена;
			ДанныеЗаписи.ОбъектФормата           = ВыборкаНетБлокируемогоОбъекта.ОбъектФормата;
			ДанныеЗаписи.ОбъектФорматаКПолучению = ВыборкаНетБлокируемогоОбъекта.ОбъектФорматаКПолучению;
			
			УдалитьЗаписьРегистра(ДанныеЗаписи, Истина);
			
	КонецЦикла;
	
	ВыборкаНетБлокирующегоОбъекта = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаНетБлокирующегоОбъекта.Следующий() Цикл
		
		ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ПолученныйОбъект                = ВыборкаНетБлокирующегоОбъекта.ОбъектКПолучению;
		ДанныеЗаписи.УзелПланаОбмена                 = ВыборкаНетБлокирующегоОбъекта.УзелПланаОбмена;
		ДанныеЗаписи.ПричинаДобавления               = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта;
		ДанныеЗаписи.ОбъектФормата                   = ВыборкаНетБлокирующегоОбъекта.ОбъектФорматаКПолучению;
		ДанныеЗаписи.ДатаУстановкиПричиныДобавления  = ТекущаяДатаСеанса();
		
		РегистрыСведений.ОбъектыКЗагрузке.ЗаписатьДанные(ДанныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет записи, которые есть в регистре, но при этом есть соответствие в ПИСО
Процедура ПроверитьЗаписиНаПредметНаличияСоответствияПИСО() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена         КАК УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФормата           КАК ОбъектФормата,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации      КАК ПравилоКонвертации
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|		ПО ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена = ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор
	|ГДЕ 
	|	(ПубличныеИдентификаторыСинхронизируемыхОбъектов.ОбъектФормата = ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению
	|		ИЛИ ПубличныеИдентификаторыСинхронизируемыхОбъектов.ОбъектФормата = """")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ПолученныйОбъект        = Выборка.ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации      = Выборка.ПравилоКонвертации;
		ДанныеЗаписи.ОбъектКПолучению        = Выборка.ОбъектКПолучению;
		ДанныеЗаписи.ОбъектФормата           = Выборка.ОбъектФормата;
		ДанныеЗаписи.ОбъектФорматаКПолучению = Выборка.ОбъектФорматаКПолучению;
		
		УдалитьЗаписьРегистра(ДанныеЗаписи, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОпосредованоБлокируемыхОбъектов(ДанныеКАнализу) 
	
	ФактическиБлокируют = НовыйТаблицаДанныхБлокируемыхОбъектов();
	
	Если ДанныеКАнализу = Неопределено Тогда
		Возврат ФактическиБлокируют;
	КонецЕсли;
	
	ДанныеДляАнализа = ДанныеКАнализу.Скопировать();
	
	УжеОпределенныеБлокирующиеОбъекты = ДанныеКАнализу.Скопировать();
	УжеОпределенныеБлокирующиеОбъекты.Свернуть("ПолученныйОбъект, ОбъектФормата, УзелПланаОбмена");
	
	Итерация = 1;
	
	Пока Истина Цикл
		
		ДанныеДляСледующегоАнализа = НовыйТаблицаОбъектыДляАнализаБлокировки();
		
		Для Каждого СтрокаТаблицы Из ДанныеДляАнализа Цикл
			
			Если СтрокаТаблицы.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов Тогда
				
				НоваяСтрока = ДанныеДляСледующегоАнализа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
			КонецЕсли;
			
			Если Итерация > 1 Тогда
				
				НоваяСтрока = ФактическиБлокируют.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				НоваяСтрока = ДанныеДляСледующегоАнализа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеДляСледующегоАнализа.Количество() = 0 Тогда
			
			Прервать;
			
		Иначе
			
			ДанныеДляАнализа = ДанныеБлокируемыхОбъектовДляМассиваОбъектов(ДанныеДляСледующегоАнализа, УжеОпределенныеБлокирующиеОбъекты);
			
		КонецЕсли;
		
		Если ДанныеДляАнализа = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Итерация = Итерация + 1;
	
	КонецЦикла;
	
	Возврат ФактическиБлокируют;
	
КонецФункции

Функция ДанныеБлокируемыхОбъектовДляМассиваОбъектов(БлокирующиеОбъекты, УжеОпределенныеБлокирующиеОбъекты = Неопределено)
	
	Если УжеОпределенныеБлокирующиеОбъекты = Неопределено Тогда
		
		УжеОпределенныеБлокирующиеОбъекты = НовыйТаблицаОбъектыДляАнализаБлокировки();
		
	КонецЕсли;
	
	ТаблицаОбъектовДляАнализа = НовыйТаблицаОбъектыДляАнализаБлокировки();
	
	Для Каждого ДанныеБлокирующегоОбъекта Из БлокирующиеОбъекты Цикл
		
		НоваяСтрока = ТаблицаОбъектовДляАнализа.Добавить();
		НоваяСтрока.ПолученныйОбъект = ДанныеБлокирующегоОбъекта.ПолученныйОбъект;
		НоваяСтрока.ОбъектФормата    = ДанныеБлокирующегоОбъекта.ОбъектФормата;
		НоваяСтрока.УзелПланаОбмена  = ДанныеБлокирующегоОбъекта.УзелПланаОбмена;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДляАнализа.ПолученныйОбъект     КАК ПолученныйОбъект,
	|	ДанныеДляАнализа.ОбъектФормата        КАК ОбъектФормата,
	|	ДанныеДляАнализа.УзелПланаОбмена      КАК УзелПланаОбмена
	|ПОМЕСТИТЬ ДанныеДляАнализа
	|ИЗ 
	|	&ДанныеДляАнализа КАК ДанныеДляАнализа
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УжеОпределенныеБлокирующиеОбъекты.ПолученныйОбъект     КАК ПолученныйОбъект,
	|	УжеОпределенныеБлокирующиеОбъекты.ОбъектФормата        КАК ОбъектФормата,
	|	УжеОпределенныеБлокирующиеОбъекты.УзелПланаОбмена      КАК УзелПланаОбмена
	|ПОМЕСТИТЬ УжеОпределенныеБлокирующиеОбъекты
	|ИЗ 
	|	&УжеОпределенныеБлокирующиеОбъекты КАК УжеОпределенныеБлокирующиеОбъекты
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект                     КАК ПолученныйОбъект,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена                      КАК УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФормата                        КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                             КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                               КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.ПричинаДобавления                              КАК ПричинаДобавления,
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта                КАК ДанныеСконвертированногоОбъекта,
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления                 КАК ДатаВозникновения,
	|	ЕСТЬNULL(ИдентификаторыОбъектовМетаданных.ПорядокКоллекции, 0)  КАК ПорядокКоллекции,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                                 КАК СоответствиеВИБ
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляАнализа КАК ДанныеДляАнализа
	|		ПО ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению           = ДанныеДляАнализа.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена         = ДанныеДляАнализа.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению = ДанныеДляАнализа.ОбъектФормата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект      = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена    = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФормата      = ОбъектыКЗагрузке.ОбъектФормата
	|		ЛЕВОЕ СОЕДИНЕНИЕ УжеОпределенныеБлокирующиеОбъекты КАК УжеОпределенныеБлокирующиеОбъекты
	|		ПО ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению           = УжеОпределенныеБлокирующиеОбъекты.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена         = УжеОпределенныеБлокирующиеОбъекты.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению = УжеОпределенныеБлокирующиеОбъекты.ОбъектФормата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО (ОбъектыКЗагрузке.ОбъектМетаданных = ИдентификаторыОбъектовМетаданных.Ссылка)
	|ГДЕ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект <> ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению
	|	И УжеОпределенныеБлокирующиеОбъекты.ПолученныйОбъект IS NULL ";
	
	Запрос.УстановитьПараметр("ДанныеДляАнализа",                  ТаблицаОбъектовДляАнализа);
	Запрос.УстановитьПараметр("УжеОпределенныеБлокирующиеОбъекты", УжеОпределенныеБлокирующиеОбъекты);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция НовыйТаблицаДанныхБлокируемыхОбъектов()
	 
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ОбъектКПолучению",                 ОбщегоНазначения.ОписаниеТипаСтрока(40));
	ТаблицаДанных.Колонки.Добавить("ПолученныйОбъект",                 ОбщегоНазначения.ОписаниеТипаСтрока(40));
	ТаблицаДанных.Колонки.Добавить("ПравилоКонвертации",               ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДанных.Колонки.Добавить("ОбъектФормата",                    ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДанных.Колонки.Добавить("ОбъектФорматаКПолучению",          ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДанных.Колонки.Добавить("УзелПланаОбмена",                  РаботаСРезультатамиОбмена.ОписаниеТипаПланыОбменаБСП());
	ТаблицаДанных.Колонки.Добавить("ПорядокКоллекции",                 ОбщегоНазначения.ОписаниеТипаЧисло(2));
	ТаблицаДанных.Колонки.Добавить("СоответствиеВИБ",                  ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	ТаблицаДанных.Колонки.Добавить("ОбъектМетаданных",                 Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	ТаблицаДанных.Колонки.Добавить("ПричинаДобавления",                Новый ОписаниеТипов("ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке"));
	ТаблицаДанных.Колонки.Добавить("ДатаВозникновения",                ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДанных.Колонки.Добавить("ДанныеСконвертированногоОбъекта",  Новый ОписаниеТипов("ХранилищеЗначения"));
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция НовыйТаблицаОбъектыДляАнализаБлокировки()
	 
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ПолученныйОбъект",                 ОбщегоНазначения.ОписаниеТипаСтрока(40));
	ТаблицаДанных.Колонки.Добавить("ОбъектФормата",                    ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДанных.Колонки.Добавить("УзелПланаОбмена",                  РаботаСРезультатамиОбмена.ОписаниеТипаПланыОбменаБСП());
	
	Возврат ТаблицаДанных;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучитьКоличествоБлокируемыхОбъектов", Истина);
	Методы.Вставить("ПолучитьДанныеБлокируемыхОбъектов", Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
